w4d4/music_app/app/controllers/albums_controller.rb

 def create
 	@album = Album.new(album_params)
 	@band = Band.find(album_params[:band_id])

 	if @album.save
---
SELECT  "bands".* FROM "bands" WHERE "bands"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "albums" ("name", "recording_type", "band_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Pinkerton"], ["recording_type", "studio"], ["band_id", 3], ["created_at", "2015-01-08 23:47:05.071366"], ["updated_at", "2015-01-08 23:47:05.071366"]]

 def update
 	@album = Album.find(params[:id])
 	@band = @album.band

 	if @album.update(album_params)
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "albums" SET "recording_type" = $1, "updated_at" = $2 WHERE "albums"."id" = $3  [["recording_type", "live"], ["updated_at", "2015-01-08 23:52:02.575108"], ["id", 1]]

 def destroy
 	@album = Album.find(params[:id])
 	@album.destroy
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "albums" WHERE "albums"."id" = $1  [["id", 2]]