w4d4/music_app/app/controllers/notes_controller.rb

SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT 1  [["id", nil]]
INSERT INTO "notes" ("content", "track_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "I really love this song!"], ["track_id", 1], ["user_id", 2], ["created_at", "2015-01-09 01:17:23.506409"], ["updated_at", "2015-01-09 01:17:23.506409"]]
---
	def create
		@note = Note.new(note_params)
		@note.user_id = current_user.id

		track = Track.find(note_params[:track_id])

		@note.save

SELECT  "notes".* FROM "notes" WHERE "notes"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "notes" WHERE "notes"."id" = $1  [["id", 2]]
---
	def destroy
		@note = Note.find(params[:id])
		track = @note.track
		if current_user.id == @note.user_id
			@note.destroy