w4d4/music_app/app/controllers/tracks_controller.rb

	def new
		@album = Album.find(params[:album_id])
---
SELECT  "albums".* FROM "albums" WHERE "albums"."id" = NULL LIMIT 1

	def create
		@track = Track.new(track_params)

		if @track.save
---
INSERT INTO "tracks" ("name", "version", "album_id", "lyrics", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "Pink Triangle"], ["version", "regular"], ["album_id", 1], ["lyrics", "Not sure..."], ["created_at", "2015-01-09 03:47:31.317041"], ["updated_at", "2015-01-09 03:47:31.317041"]]

	def edit
		@track = Track.find(params[:id])
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT 1  [["id", 1]]

	def update
		@track = Track.find(params[:id])
		@album = @track.album
		@band = @album.band

		if @track.update(track_params)
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "tracks" SET "name" = $1, "updated_at" = $2 WHERE "tracks"."id" = $3  [["name", "El Scorcho2"], ["updated_at", "2015-01-09 00:22:46.702572"], ["id", 1]]

	def destroy
		@track = Track.find(params[:id])
		@track.destroy
---
SELECT  "tracks".* FROM "tracks" WHERE "tracks"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "tracks" WHERE "tracks"."id" = $1  [["id", 2]]