w4d4/music_app/app/controllers/users_controller.rb

INSERT INTO "users" ("email", "password_digest", "session_token", "activation_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
	def create
		@user = User.new(user_params)

		if @user.save

SELECT  "users".* FROM "users" WHERE "users"."activation_token" = $1 LIMIT 1  [["activation_token", "6B1gv6FZiaN_bZpoRAHipQ"]]
---
	def activate
		@user = User.find_by_activation_token(params[:activation_token])