w4d3/app/controllers/cat_rental_requests_controller.rb

SELECT "cats".* FROM "cats"
---
  def new
    @request = CatRentalRequest.new
    @request.cat_id = params[:cat_id]
    @cats = Cat.all

INSERT INTO "cat_rental_requests" ("start_date", "end_date", "cat_id", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["start_date", "2012-01-30"], ["end_date", "2015-12-31"], ["cat_id", 8], ["status", "PENDING"], ["created_at", "2015-01-07 22:54:13.887138"], ["updated_at", "2015-01-07 22:54:13.887138"]]
---
  def create
    @cats = Cat.all #to show the cats in render :new

    @request = CatRentalRequest.new(req_params)
    @request.user_id = current_user.id

    if @request.save

SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE ((1 IS NULL) OR (id != 1)) AND "cat_rental_requests"."cat_id" = $1 AND (         NOT( (start_date > '2015-12-31') OR (end_date < '2012-01-30') )
---
  def approve
    @request = CatRentalRequest.find(params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT 1  [["id", 4]]
---
  def deny
    @request = CatRentalRequest.find(params[:id])

SELECT  "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "cat_rental_requests" WHERE "cat_rental_requests"."id" = $1  [["id", 1]]
---
  def destroy
    @request = CatRentalRequest.find(params[:id])
    CatRentalRequest.destroy(@request)