w4d3/app/controllers/cats_controller.rb

  def create
    @cat = Cat.new(cat_params)
    @cat.user_id = current_user.id
    if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "sex", "description", "name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @cat = Cat.find(params[:id])

    if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "cats" SET "description" = $1, "name" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["description", "Loves hip hop.      \r\n      "], ["name", "Marky Mark"], ["updated_at", "2015-01-07 23:12:52.997521"], ["id", 13]]

  def destroy
    @cat = Cat.find(params[:id])
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT 1  [["id", 8]]