w4d3/app/controllers/sessions_controller.rb

  def destroy
    token = SessionToken.find(params[:id])
    if token.token == session[:token]
      logout_user!(token.user)
    else
      token.destroy
---
SELECT  "session_tokens".* FROM "session_tokens" WHERE "session_tokens"."token" = $1 LIMIT 1  [["token", "j9O3auNg5Rjf2FWKLcRzCg"]]
DELETE FROM "session_tokens" WHERE "session_tokens"."id" = $1  [["id", 7]]