w4d4/music_app/app/views/users/index.html.erb

SELECT "users".* FROM "users"
---
<ul>
<% User.all.each do |user| %>