w4d3/app/views/users/show.html.erb

SELECT  "session_tokens".* FROM "session_tokens" WHERE "session_tokens"."token" = $1 LIMIT 1  [["token", "Wkp-cnPPAkFVxz6Nqih_Ng"]]
---
			<div class="list-group">
				<% @user.session_tokens.each do |token| %>