w4d4/music_app/app/views/tracks/show.html.erb

SELECT "notes".* FROM "notes" WHERE "notes"."track_id" = $1  [["track_id", 1]]
---
<ol>
	<% @track.notes.each do |note| %>